[
    {
        "id":"leta",
        "name":"Missing husband",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Leta in Crossglen village wants me to look for her husband Oromir.",
                "finishesQuest":0
            },
            {
                "progress":20,
                "logText":"I have found Oromir in Crossglen village, hiding from his wife Leta.",
                "finishesQuest":0
            },
            {
                "progress":25,
                "logText":"I have found Oromir in Crossglen village, hiding from his wife Leta, but I promised him that I would not tell Leta of his whereabouts.",
                "rewardExperience":50
            },
            {
                "progress":30,
                "logText":"Leta asked me to tell Oromir to come home and help her with the housework.",
                "rewardExperience":80
            },
            {
                "progress":35,
                "logText":"I have found Oromir behind the Crossglen village inn, hiding from his wife Leta, but I promised him that I would not tell Leta of his whereabouts.",
                "rewardExperience":50
            },
            {
                "progress":40,
                "logText":"I have found Oromir behind the Crossglen village inn, hiding from his wife Leta, but I should tell Leta of his whereabouts."
            },
            {
                "progress":45,
                "logText":"I have found Oromir in Crossglen village behind a haystack, hiding from his wife Leta, but I promised him that I would not tell Leta of his whereabouts.",
                "rewardExperience":50
            },
            {
                "progress":50,
                "logText":"Leta asked me to tell Oromir to come home and help her with the housework.",
                "rewardExperience":80
            },
            {
                "progress":60,
                "logText":"I have found Oromir in Crossglen village behind a haystack, hiding from his wife Leta, I should tell Leta of his whereabouts."
            },
            {
                "progress":70,
                "logText":"Leta asked me to tell Oromir to come home and help her with the housework.",
                "rewardExperience":80
            },
            {
                "progress":80,
                "logText":"I have found Oromir in the basement of his house, hiding from his wife Leta, I should tell Leta of his whereabouts."
            },
            {
                "progress":100,
                "logText":"I have told Leta that Oromir is hiding in their basement.",
                "rewardExperience":80,
                "finishesQuest":1
            },
            {
                "progress":105,
                "logText":"Even after all my help, Oromir was still brought back home to Leta.",
                "rewardExperience":50,
                "finishesQuest":1
            }
        ]
    }
]