[
    {
        "id":"brv_nondisplay_multipurpose",
        "name":"brv_nondisplay_multipurpose",
        "stages":[
            {
                "progress":10,
                "logText":"Knows about laundry offering upgrades"
            },
            {
                "progress":15,
                "logText":"Knows about dresses"
            },
            {
                "progress":20,
                "logText":"brother2_door_opened"
            },
            {
                "progress":30,
                "logText":"never true"
            },
            {
                "progress":40,
                "logText":"told father about andor"
            },
            {
                "progress":50,
                "logText":"Arlish took the dagger"
            },
            {
                "progress":60,
                "logText":"Gave Mustura the glove"
            }
        ]
    },
    {
        "id":"brv_dagger",
        "name":"A strange-looking dagger",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I asked Edrin about the strange-looking dagger I purchased. He told me he recognizes it because he made it many years ago, and it used to have a gem mounted in the pommel. If I can find the gem he can remount it in the dagger, and the dagger will have special properties."
            },
            {
                "progress":20,
                "logText":"I asked Edrin about the strange-looking gem I purchased, and whether he has any idea what it might have been mounted in. He told me he recognizes it, and it used to be mounted in the pommel of a dagger that he made many years ago. If I can find the dagger he can remount the gem, and the dagger will have special properties."
            },
            {
                "progress":25,
                "logText":"I asked Edrin about the strange-looking dagger and the strange-looking gem I purchased. He told me he recognizes them because he made the dagger many years ago. The gem was originally mounted in the pommel, giving the dagger special properties. He offered to repair it for me."
            },
            {
                "progress":30,
                "logText":"I asked the thief if the dagger he has originally had the gem I purchased in the pommel. His reply was 'maybe', and that the dagger was no longer available except at a 'special' price."
            },
            {
                "progress":40,
                "logText":"I asked the thief if the gem he has was originally in the pommel of the dagger I purchased. His reply was 'maybe', and that the gem was no longer available except at a 'special' price."
            },
            {
                "progress":50,
                "logText":"I showed the strange-looking dagger and the strange-looking gem to Edrin. He said they match, and he can repair the dagger by mounting the gem in the pommel again."
            },
            {
                "progress":60,
                "logText":"Edrin wants 800gp to repair the dagger. I told him I will think about it."
            },
            {
                "progress":70,
                "logText":"Edrin wants 800gp to repair the dagger. I told him that was too expensive. I will keep the strange-looking dagger and the strange-looking gem.",
                "rewardExperience":500,
                "finishesQuest":1
            },
            {
                "progress":80,
                "logText":"Edrin wants 800gp to repair the dagger. I agreed. Edrin took the dagger and the gem and told me to come back later."
            },
            {
                "progress":90,
                "logText":"I collected the repaired dagger from Edrin.  Apparently it used to belong to someone named Lawellyn.",
                "rewardExperience":600
            },
            {
                "progress":100,
                "logText":"I collected the repaired dagger from Edrin.  Apparently it used to belong to someone named Lawellyn.",
                "rewardExperience":300
            },
            {
                "progress":110,
                "logText":"I've found a gravestone that told me that Lawellyn was related to Arlish.  Is she still alive?  I should try to find her.",
                "rewardExperience":100
            },
            {
                "progress":115,
                "logText":"Arlish couldn't tell me anything about the dagger because I no longer have it.",
                "finishesQuest":1
            },
            {
                "progress":120,
                "logText":"I decided to not help Arlish by investigating Lawellyn's disappearance.",
                "finishesQuest":1
            },
            {
                "progress":130,
                "logText":"I decided to help Arlish by investigating Lawellyn's disappearance."
            },
            {
                "progress":140,
                "logText":"In Brimhaven's western tavern, I met a man named Forlin who recommended that I speak to Kizzo in the Loneford tavern."
            },
            {
                "progress":150,
                "logText":"Kizzo suggested that I look for the crime scene."
            },
            {
                "progress":160,
                "logText":"I should take the crime scene evidence to Kizzo.",
                "rewardExperience":200
            },
            {
                "progress":170,
                "logText":"Kizzo recommended that I ask Venanra in Brimhaven about the glove."
            },
            {
                "progress":180,
                "logText":"After speaking with Venanra, I learned that the glove belonged to Ogea."
            },
            {
                "progress":190,
                "logText":"I accepted Ogea's side of the story."
            },
            {
                "progress":200,
                "logText":"I was not able to help Arlish find out more about the death of her father.",
                "rewardExperience":300,
                "finishesQuest":1
            },
            {
                "progress":210,
                "logText":"I decided that Ogea should be punished."
            },
            {
                "progress":220,
                "logText":"I informed the authorities of the results of my investigation."
            },
            {
                "progress":230,
                "logText":"Arlish thanked me for finding her father's murderer, and gave me his dagger as a gift.",
                "rewardExperience":1000,
                "finishesQuest":1
            }
        ]
    }
]